[
  {
    "name": "tasktimer",
    "repoName": "task-timer",
    "about": [
      "This application is an advanced Pomodoro Clock built with React, featuring a playful, interactive board game-like interface. It supports concurrent multi-tasking, allowing multiple tasks to run simultaneously."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "adding / removing users with unique logins and secured by password",
          "'remember me' functionality when user logs in / signs in",
          "user editing section allowing to change user's login, password, log out or remove user's profile",
          "creating / editing / removing tasks",
          "user can specify a task name, time to finish the task and maximum break time",
          "all inputs have validation rules applied to them",
          "work and break time countdown available for multiple cards simultaneously",
          "two display modes for work and break phases showing either elapsed or remaining time",
          "progress bars with percentage values indicates elapsed or remaining time as well, depending on the current display mode",
          "card's outro mode appears on task finish or when the maximum break time gets exceeded, summarizing that given task's stats",
          "drag and drop functionality for task cards with transition effects",
          "cards can be minimized to more concise form and display only the task name",
          "stats section for all finished tasks",
          "data stored in local storage as Json format"
        ]
      },
      {
        "label": "Visual Appearance",
        "items": [
          "intro animation is based on SVG logo with masking applied to casted shadow",
          "shadow's spiral trajectory is calculated using trigonometric functions",
          "all tasks form grid of elements resembling cards laid out on a game board rotating 180 degrees on every status change",
          "app is fully responsive with grid of cards adjusting to viewport size",
          "all cards are minimized by default on mobile devices due to accessibility reasons",
          "project's mockup was created in Figma"
        ]
      }
    ],
    "icons": [
      {
        "name": "react",
        "totalSVG": 1
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "hydrapp",
    "repoName": "hydrApp",
    "about": [
      "This application is a water consumption tracker that allows users to easily log their daily water intake. It features an archive section for viewing weekly consumption trends and an account settings section for personalization. Users can view their own and others' statistics. The app incorporates gamification elements, rewarding users with points for maintaining consistent water intake, and features a dynamic user ranking system."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "editable archive section with a list of days divided on weeks",
          "new archive's entry creator",
          "weeks calendar is automatically updated after adding or removing an entry",
          "burger button menu",
          "stats section displaying results of each user",
          "calculated current and longest user's streak",
          "ranking of users based on highest point score",
          "settings section allowing to log out, remove account or edit profile settings",
          "data stored in local storage as Json format"
        ]
      },
      {
        "label": "Visual Appearance",
        "items": [
          "intro animation",
          "animated graphical representation of water",
          "animated counter displaying amount of consumed water",
          "emoji icons indicating current level of consumed level of water on a given day",
          "animated icons and buttons and smooth transitions between sections",
          "responsiveness"
        ]
      },
      {
        "label": "To be implemented",
        "items": [
          "calculating optimal amount of water based on the user's weight",
          "fetching data about weather conditions in user's location from external API and recalculating minimum amount of water to be consumed"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "portfolio",
    "repoName": "portfolio-page",
    "about": [
      "This project is a showcase of my top five frontend projects, including this one, each presented in its own section. Additional sections feature simpler, early-stage projects. The site is a Single Page Application (SPA) with a focus on interactivity and animation, balanced with performance considerations to ensure smooth transitions.",
      "Each section features a unique color palette, resulting in a total of 68 different colors across the site, managed effectively using SCSS. The project was initially built with vanilla JavaScript and later rewritten using React."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "website fetches my github repositories data using github API and searches for total number of commits, date of creation and last modification of each repo",
          "expandable content functionality implemented by using recursive functions and a global object. It is applicable for plain text and more complex, nested elements like lists of items or lists inside another ones",
          "accordion elements handling nested content"
        ]
      },
      {
        "label": "Interaction",
        "items": [
          "menu links appearance depends on currently displayed section",
          "smooth scroll to the next section when user scrolls down fast enough",
          "animated graphic elements serve as additional visual indicator"
        ]
      },
      {
        "label": "Intro Animation",
        "items": [
          "created with extensive use of setTimeout callback functions (because of a little callback hell, I want to rewrite this part using Promises)",
          "transitions are mainly controlled with JS because of dynamically changing elements in the viewport",
          "animated text is composed of SVG letters, but the output is based on simple string input"
        ]
      },
      {
        "label": "Visual Appearance",
        "items": [
          "colors applied using SCSS variables",
          "each section has its own dedicated logo, being an SVG graphic element",
          "grids of multiple SVG icons",
          "animated elements and transitions emphasizes creative and dynamic look of the website"
        ]
      },
      {
        "label": "Responsiveness",
        "items": [
          "website layout based on CSS Grid (grid-areas mostly)",
          "different behavior of menu/content transition for mobile and tablet/desktop devices",
          "animated navigation buttons on tablets and large screen devices and burger button on mobiles"
        ]
      },
      {
        "label": "Contact Form",
        "items": [
          "supported with frontend and backend validation",
          "AJAX request written in vanilla JS",
          "mail sending functionality based on phpmailer class",
          "server responses and backend validation result displayed as animated alert boxes",
          "Local storage support for contact form inputs"
        ]
      },
      {
        "label": "Overall",
        "items": [
          "project's precise mockup created in Figma",
          "website seed by yeoman - generator webapp"
        ]
      },
      {
        "label": "To Be Implemented",
        "items": [
          "Bonus functionality allowing to generate and display intro animation with content based on the string input provided by the user"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "react",
        "totalSVG": 1
      },
      {
        "name": "typescript",
        "totalSVG": 1
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "archviz",
    "repoName": "archviz-website",
    "about": [
      "This project balances the use of high-quality images with page load performance by implementing SVG placeholders for each image. Raster images are loaded progressively based on their visibility on the screen, utilizing lazy loading. The project is built primarily with custom functions, with few exceptions. All visualizations on the site were created by me when I used to work as an architectural visualizer."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "Responsive grid of images written in JS. Each row's height depends on an aspect ratios of the neighboring images located in a particular row and taking the whole width of the container",
          "Sprite map of SVG placeholders for every visualization loaded up as starting content to improve perceived performance of the page load and set grid layout for images",
          "Lazy loading for grid images and gallery pictures (recursive function)",
          "Responsive slider gallery of images",
          "Two display modes in gallery view (image and SVG placeholder modes)",
          "Fully functional contact form with checkbox verification and backend validation",
          "Simple accordions in about section",
          "Page pre-loader",
          "Improved content accessibility according to WCAG"
        ]
      },
      {
        "label": "To be implemented",
        "items": [
          "More detailed and animated page pre-loader containing website's SVG logo"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "sass",
        "totalSVG": 1
      },
      {
        "name": "php",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "quotes",
    "repoName": "homepage-gulp",
    "about": [
      "This project is a Multi-Page Application (MPA) featuring a collection of quotes accompanied by visually appealing images. The design emphasizes continuity during navigation to mimic the feel of a simple app. All images were personally captured and post-processed during my year-long stay in Slovenia."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "random quote functionality",
          "simple and basic PWA",
          "keyboard support for navigating between pages",
          "burger button menu",
          "animated SVG icons",
          "transition effect for grid of images with delays applied using SCSS loop",
          "responsive layout and grid of images",
          "local storage support for contact form's inputs",
          "contact form's HTML validation",
          "checkboxes validation and alerts",
          "TO BE IMPLEMENTED: contact form JS validation and functionality"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  }
]
