[
  {
    "name": "glob3d",
    "repoName": "glob3d",
    "about": ["test"],
    "features": [
      {
        "label": "Functionality",
        "items": [""]
      }
    ],
    "icons": [
      {
        "name": "typescript",
        "totalSVG": 1
      },
      {
        "name": "react",
        "totalSVG": 1
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "tasktimer",
    "repoName": "task-timer",
    "about": [
      "This excercise application is quite advanced Pomodoro Clock built with React, featuring a playful, interactive board game-like interface. It supports concurrent multi-tasking, allowing multiple tasks to run simultaneously."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "simplistic client-side user authentication",
          "user's profile edition",
          "creating, editing and removing tasks by specifying a task name, time and maximum break time",
          "validation rules applied to inputs",
          "progress bars for both elapsed and remaining time modes",
          "stats section for all finished tasks",
          "local storage support for saving the data"
        ]
      },
      {
        "label": "User Interface",
        "items": [
          "intro animation is based on SVG logo with masking applied to casted shadow",
          "minimizable cards",
          "drag and drop functionality without third-party libraries",
          "app is fully responsive with grid of cards adjusting to viewport size",
          "implemented based on the Figma mockup"
        ]
      }
    ],
    "icons": [
      {
        "name": "typescript",
        "totalSVG": 1
      },
      {
        "name": "react",
        "totalSVG": 1
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "hydrapp",
    "repoName": "hydrApp",
    "about": [
      "This playful app is a water consumption tracker that allows users to easily log their daily water intake. It features an archive section for viewing weekly consumption trends and an account settings section for personalization. Users can view their own and others' statistics. The app incorporates gamification elements, rewarding users with points for maintaining consistent water intake, and features a dynamic user ranking system."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "archive section for viewing weekly consumption trends",
          "stats section displaying each user's daily water intake",
          "calculating user's current and longest streak",
          "ranking of users based on highest point score",
          "profile settings edition",
          "local storage support for saving the data"
        ]
      },
      {
        "label": "Animations",
        "items": [
          "intro animation",
          "animated water level and counter",
          "emojis indicating consumed amount of water"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "portfolio",
    "repoName": "portfolio-page",
    "about": [
      "This project is a showcase of my top five frontend projects, including this one, each presented in its own section. Additional sections feature simpler, early-stage projects. The site is a Single Page Application (SPA) with a focus on interactivity and animation, balanced with performance considerations to ensure smooth transitions.",
      "Each section features a unique color palette, resulting in a total of 68 different colors across the site, managed effectively using SCSS. The project was initially built with vanilla JavaScript and later rewritten using React."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "async/await code for executing intro animations in a sequence",
          "using github API to fetch project details data",
          "custom accordions without use of third-party libraries",
          "extensive use of SVG elements - logos, graphics, menu items",
          "different menu components for mobile and desktop devices"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "typescript",
        "totalSVG": 1
      },
      {
        "name": "react",
        "totalSVG": 1
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  },
  {
    "name": "archviz",
    "repoName": "archviz-website",
    "about": [
      "This project balances the use of high-quality images with page load performance by implementing SVG placeholders for each image. Raster images are loaded progressively based on their visibility on the screen, utilizing lazy loading. The project is built primarily with custom functions, with few exceptions. All visualizations on the site were created by me when I used to work as an architectural visualizer."
    ],
    "features": [
      {
        "label": "Functionality",
        "items": [
          "custom responsive grid of images written in JS. Each row's height depends on an aspect ratios of the images on the same row",
          "SVG placeholders for loading visualizations",
          "custom lazy loading for grid images and gallery pictures",
          "responsive carousel of images with two display modes",
          "page pre-loader"
        ]
      }
    ],
    "icons": [
      {
        "name": "html",
        "totalSVG": 3
      },
      {
        "name": "css",
        "totalSVG": 3
      },
      {
        "name": "javascript",
        "totalSVG": 3
      },
      {
        "name": "sass",
        "totalSVG": 1
      }
    ]
  }
]
